In [3]:
import pandas as pd
salary=pd.read_csv(r"C:\Users\rks91\Downloads\New folder\salary_satisfaction.csv")
#from stasmodels.stats.weightstats import ttest_ind

In [2]:
import numpy as np
import scipy

In [4]:
salary.head()

     Service Salary
0  excellent    low
1  excellent    low
2  excellent    low
3  excellent    low
4  excellent    low

In [6]:
salary_table=pd.crosstab(salary.Service,salary.Salary)
salary_table

Salary     high  low  medium
Service
excellent     7    9      10
good         31   11       9
poor          3   12       8

In [7]:
#Chi square
#Ho there is no relationship between salary paid and service offered
#Ha there is relationship between salary paid and service offered

In [8]:
from scipy.stats import chi2_contingency

In [9]:
chi2_contingency(salary_table)

(18.658230409973125,
 0.0009172334128317392,
 4,
 array([[10.66,  8.32,  7.02],
        [20.91, 16.32, 13.77],
        [ 9.43,  7.36,  6.21]]))

In [10]:
#since the p value is less than .05 we will reject the null and conclude 
#      that there is relationship between Salary paid and service offered

In [13]:
result=chi2_contingency(salary_table)
print("p-value is ",result[1])
print("-------------------------")
if result[1]<.05:
    print("Reject the null, there is relationship between  the variables")
else:
    print("Fail to reject the null, there is no relationship between the variables")

p-value is  0.0009172334128317392
-------------------------
Reject the null, there is relationship between  the variables

In [ ]:
# hi=[]
# for i in range(0,18):
#     oh=((empty_list[i]-empty_list[i+1])/empty_list[i])
#     hi.append(oh)
#     hi.append(i+2)

In [ ]:
# read the credit risk file ..where loan status is target variable and appy this chi-sqaure on
# gender, education, credit hostroy , married ,preoperty area

# and tell which all features are important

In [21]:
cr=pd.read_csv(r"C:\Users\rks91\Downloads\New folder\CreditRisk.csv")

In [15]:
cr.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [16]:
# cr.Gender = cr.Gender.fillna('Male')
# cr.Married = cr.Married.fillna("Yes")
# cr.Dependents = cr.Dependents.fillna(0)
# cr.Self_Employed = cr.Self_Employed.fillna('No')
# cr.LoanAmount = cr.LoanAmount.fillna(120)
# cr.Loan_Amount_Term = cr.Loan_Amount_Term.fillna(360)
# cr.Credit_History = cr.Credit_History.fillna(1)
# #-------------------
# cr.Gender.replace({"Male": 1, "Female": 0}, inplace = True)
# cr.Married.replace({"No": 0, "Yes": 1}, inplace = True)
# cr.Education.replace({"Graduate" : 1, "Not Graduate": 0}, inplace = True)
# cr.Self_Employed.replace({"No": 0, "Yes": 1}, inplace = True)
# cr.Property_Area.replace({"Semiurban": 1, "Urban": 2, "Rural": 3}, inplace = True)
# cr.Loan_Status.replace({"Y": 1, "N": 0}, inplace = True)
# #-------------------
# cr=cr.iloc[:,1:]

In [22]:
cr1=cr.select_dtypes(include='object')

In [23]:
cr1.head()

,Loan_ID,Gender,Married,Education,Self_Employed,Property_Area,Loan_Status
0,LP001002,Male,No,Graduate,No,Urban,Y
1,LP001003,Male,Yes,Graduate,No,Rural,N
2,LP001005,Male,Yes,Graduate,Yes,Urban,Y
3,LP001006,Male,Yes,Not Graduate,No,Urban,Y
4,LP001008,Male,No,Graduate,No,Urban,Y

In [ ]:
#cr.dropna()

In [24]:
cr1=cr1.iloc[:,1:]

In [25]:
cr1.columns

Index(['Gender', 'Married', 'Education', 'Self_Employed', 'Property_Area',
       'Loan_Status'],
      dtype='object')

In [30]:
for i in cr1.columns:
    tab=pd.crosstab(cr1[i],cr1.Loan_Status)
    result=chi2_contingency(tab)
    print("-------------------------------------------------------------")
    print("-------------------------------------------------------------")
    print("name of the feature is " , i)
    print("P-Value is " ,result[1] )

    if result[1] < .05:
        print("Reject the NUll , there is relationship between the variables" , i , "and Loan Status")
        print("-------------------------------------------------------------")
        print("-------------------------------------------------------------")
    else:
        print("Fail to Reject the NUll , there is NO relationship between the variables" , i , "and Loan Status")
        print("-------------------------------------------------------------")
        print("-------------------------------------------------------------")

-------------------------------------------------------------
-------------------------------------------------------------
name of the feature is  Gender
P-Value is  0.3879561718664325
Fail to Reject the NUll , there is NO relationship between the variables Gender and Loan Status
-------------------------------------------------------------
-------------------------------------------------------------
-------------------------------------------------------------
-------------------------------------------------------------
name of the feature is  Married
P-Value is  0.006879989829483938
Reject the NUll , there is relationship between the variables Married and Loan Status
-------------------------------------------------------------
-------------------------------------------------------------
-------------------------------------------------------------
-------------------------------------------------------------
name of the feature is  Education
P-Value is  0.028518487896416037
Reject the NUll , there is relationship between the variables Education and Loan Status
-------------------------------------------------------------
-------------------------------------------------------------
-------------------------------------------------------------
-------------------------------------------------------------
name of the feature is  Self_Employed
P-Value is  0.45482709584676606
Fail to Reject the NUll , there is NO relationship between the variables Self_Employed and Loan Status
-------------------------------------------------------------
-------------------------------------------------------------
-------------------------------------------------------------
-------------------------------------------------------------
name of the feature is  Property_Area
P-Value is  0.0004646575726159221
Reject the NUll , there is relationship between the variables Property_Area and Loan Status
-------------------------------------------------------------
-------------------------------------------------------------
-------------------------------------------------------------
-------------------------------------------------------------
name of the feature is  Loan_Status
P-Value is  2.985544513350364e-214
Reject the NUll , there is relationship between the variables Loan_Status and Loan Status
-------------------------------------------------------------
-------------------------------------------------------------

In [26]:
####ANNOVA
from scipy.stats import f_oneway

In [27]:
resturant=pd.read_csv(r"C:\Users\rks91\Downloads\New folder\restuarnt.csv")

In [29]:
resturant

   samosa  Vada  PauBaji
0      21    49       15
1      41    56       23
2      43    17       21
3      55    48       25
4      45    43       34
5      37    32       39
6      29    33       30

In [31]:
f_oneway(resturant.samosa,resturant.Vada,resturant.PauBaji)

F_onewayResult(statistic=3.0078196272644337, pvalue=0.07464576690389685)

In [33]:
res_ann=f_oneway(resturant.samosa,resturant.Vada,resturant.PauBaji)
res_ann[1]

0.07464576690389685

In [34]:
res_ann=f_oneway(resturant.samosa,resturant.Vada,resturant.PauBaji)
if res_ann[1]>.05:
    print("P value is",res_ann[1])
    print("we fail to reject Null")
else:
    print("P value is",res_ann[1])
    print("we reject the Null")

P value is 0.07464576690389685
we fail to reject Null

In [42]:
cr=pd.read_csv(r"C:\Users\rks91\Downloads\New folder\CreditRisk.csv")

In [ ]:
cr=cr.dropna()

In [36]:
cr.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
5,LP001011,Male,Yes,2.0,Graduate,Yes,5417,4196.0,267.0,360.0,1.0,Urban,Y

In [37]:
cr_grad=cr[cr.Education=='Graduate']
##DF  with only graduates

In [40]:
cr_not_grad=cr[cr.Education=='Not Graduate']
##DF with only non graduates

In [41]:
res_gred_not_grad=f_oneway(cr_grad.ApplicantIncome,cr_not_grad.ApplicantIncome)
res_gred_not_grad

F_onewayResult(statistic=13.386932225130057, pvalue=0.0002707231737544296)